%%%%此文件仅仅是项目初期进行实验的文件，删除后不影响项目使用。

% warning off;
clc;
clear;

%subplot(221,'position',[0.1,0.6,0.3,0.3]);
% T=input('请输入T:');
% mu=input('请输入mu');
T=200;
mu=28;
v=0:3000;%设置速率坐标取值范围

y=mx(T,mu,v);
plot(v,y,'color',rand(3,1),'LineWidth',3)%绘制坐标曲线
xlabel('速率');ylabel('概率密度fv');
axis([0,3000,0,3e-3]);
v1=((2*1.381*10^(-23)*T)/((mu*10^(-3))/(6.022*10^23))).^0.5;%最概然速率；
v2=((3*1.38*10^(-23)*T)/((mu*10^(-3))/(6.022*10^23))).^0.5;%输出方均根速率
v3=(((8*1.381*10^(-23)*T)/((pi*mu*10^(-3))/(6.022*10^23))).^0.5);%输出平均速率

legend(['最概然速率为：',num2str(v1),sprintf('\n'), '平均速率为：',num2str(v3),sprintf('\n'),'方均根速率为：',num2str(v2)]);

disp(['最概然速率为：',num2str(v1)]);
disp(['平均速率为：',num2str(v3)]);
disp(['方均根速率为：',num2str(v2)]);
 



